In [1]:
import pandas as pd
import seaborn as sns
import matplotlib as plt

In [ ]:
user_data=pd.read_csv('https://stepik.org/media/attachments/lesson/360348/user_data.csv')
logs=pd.read_csv('https://stepik.org/media/attachments/lesson/360348/logs.csv')

In [ ]:
user_data.head()

In [20]:
logs.head()

   client  success  platform        time
0   40177     True     phone  1585412212
1   61468     True     phone  1585425658
2   35604    False     phone  1585459894
3    9961     True     phone  1585400189
4   10931     True  computer  1585468629

In [22]:
logs.platform.value_counts()

phone       2753
computer    1505
tablet       242
Name: platform, dtype: int64

In [25]:
logs.platform.nunique()

3

In [26]:
user_data.shape

(2954, 3)

In [27]:
user_data.dtypes

client     int64
premium     bool
age        int64
dtype: object

In [35]:
# count empty cells
logs.isna().sum()

client      0
success     0
platform    0
time        0
dtype: int64

In [33]:
user_data.describe()

             client          age
count   2954.000000  2954.000000
mean   50767.886594    44.196005
std    28800.505847    14.248336
min       40.000000    20.000000
25%    25639.500000    32.000000
50%    51569.500000    44.000000
75%    75963.250000    56.000000
max    99973.000000    69.000000

In [34]:
logs.describe()

             client          time
count   4500.000000  4.500000e+03
mean   50998.758000  1.585440e+09
std    28374.472495  2.314866e+04
min       40.000000  1.585400e+09
25%    27056.500000  1.585420e+09
50%    52659.000000  1.585440e+09
75%    76001.250000  1.585461e+09
max    99993.000000  1.585480e+09

In [45]:
success_number=logs.query('success==True')\
      .groupby('client', as_index=False).agg({'platform':'count'})\
      .rename(columns={'platform':'success_number'})\
      .sort_values('success_number', ascending=False)

In [52]:
max_success=success_number.success_number.max()
success_number.query('success_number==@max_success')\
    .sort_values('client')\
    .client\
    .tolist()

[12179, 28719, 36165, 52870, 61468, 61473, 78349, 82563, 92584]

In [62]:
logs.query('success==True')\
    .groupby('platform')\
    .agg({'client':'count'})\
    .idxmax()

client    phone
dtype: object

In [63]:
logs.head()

   client  success  platform        time
0   40177     True     phone  1585412212
1   61468     True     phone  1585425658
2   35604    False     phone  1585459894
3    9961     True     phone  1585400189
4   10931     True  computer  1585468629

In [64]:
logs.merge(user_data, on='client')

      client  success  platform        time  premium  age
0      61468     True     phone  1585425658    False   25
1      61468     True  computer  1585460504    False   25
2      61468     True  computer  1585430291    False   25
3      61468     True  computer  1585444317    False   25
4      61468     True     phone  1585441266    False   25
...      ...      ...       ...         ...      ...  ...
3434   62438    False     phone  1585479041    False   36
3435   95152     True  computer  1585420263    False   67
3436   64496    False  computer  1585459072    False   66
3437    8967     True     phone  1585465121    False   33
3438   40921     True     phone  1585437692    False   45

[3439 rows x 6 columns]

In [70]:
user_data_logs=logs.merge(user_data, on='client')
user_data_logs.query('premium==True').platform.value_counts()

phone       246
computer    150
tablet       24
Name: platform, dtype: int64

In [98]:
premium_data=user_data.query('premium==True')
nonpremium_data=user_data.query('premium==False')

In [ ]:
sns.displot(data=premium_data, x='age', kde=True)
sns.displot(data=nonpremium_data, x='age', kde=True)

In [101]:
logs.head()

   client  success  platform        time
0   40177     True     phone  1585412212
1   61468     True     phone  1585425658
2   35604    False     phone  1585459894
3    9961     True     phone  1585400189
4   10931     True  computer  1585468629

In [115]:
success_count=logs.query('success==True')\
    .groupby('client')\
    .agg({'success':'sum'})
sns.displot(data=success_count, x='success', kde=False)

In [118]:
user_data_logs.head()

   client  success  platform        time  premium  age
0   61468     True     phone  1585425658    False   25
1   61468     True  computer  1585460504    False   25
2   61468     True  computer  1585430291    False   25
3   61468     True  computer  1585444317    False   25
4   61468     True     phone  1585441266    False   25

In [124]:
age_vs_successn=user_data_logs.query('platform=="computer"')\
    .groupby('age', as_index=False)\
    .agg({'success':'count'})

In [125]:
age_vs_successn

    age  success
0    20       19
1    21       20
2    22       12
3    23       17
4    24       28
5    25       38
6    26       22
7    27       23
8    28       54
9    29       25
10   30       15
11   31       21
12   32       31
13   33       26
14   34       16
15   35       26
16   36       20
17   37       20
18   38       20
19   39       16
20   40       27
21   41       16
22   42       20
23   43       26
24   44       24
25   45       20
26   46       26
27   47       18
28   48       22
29   49       41
30   50       19
31   51       17
32   52       30
33   53       11
34   54       28
35   55       16
36   56        8
37   57       18
38   58       22
39   59       26
40   60       22
41   61       28
42   62       21
43   63       20
44   64       18
45   65       29
46   66       19
47   67       25
48   68       29
49   69       25

In [132]:
sns.barplot(x='age', y='success', data=age_vs_successn)

In [134]:
computer_success=user_data_logs.query('platform=="computer"')

In [136]:
sns.countplot(computer_success.age)